create_clock -period 20.000 -name clk_50M -waveform {0.000 10.000} [get_ports clk_50M]
create_clock -period 90.422 -name clk_11M0592 -waveform {0.000 45.211} [get_ports clk_11M0592]

set sram_clk       [get_clocks clk_out4_main_pll]
set main_clk       [get_clocks clk_out3_main_pll]
set peripheral_clk [get_clocks clk_out2_main_pll]

set_false_path -from $peripheral_clk        -to $main_clk

set_input_delay  -clock $sram_clk -min -add_delay 8.000  [get_ports {base_ram_data[*]}]
set_input_delay  -clock $sram_clk -max -add_delay 10.000 [get_ports {base_ram_data[*]}]
set_input_delay  -clock $sram_clk -min -add_delay 8.000  [get_ports {ext_ram_data[*]}]
set_input_delay  -clock $sram_clk -max -add_delay 10.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_addr[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_addr[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_be_n[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_be_n[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_data[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_data[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_addr[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_addr[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_be_n[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_be_n[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_ce_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_ce_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_oe_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_oe_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_we_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_we_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_ce_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_ce_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_oe_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_oe_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_we_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_we_n}]
